#   19、写代码，有如下列表，利用切片实现每一个功能
li = [1, 3, 2, "a", 4, "b", 5, "c"]
#       li = [1, 3, 2, "a", 4, "b", 5, "c"]
#           1)通过对li列表的切片形成新的列表l1, l1 = [1, 3, 2]
l1 = li[0:3]
print(li)
#           2)通过对li列表的切片形成新的列表l2, l2 = ["a", 4, "b"]
l2 = li[3:6]
print(l2)
#           3)通过对li列表的切片形成新的列表l3, l3 = ["1,2,4,5]
l3 = li[::2]
print(l3)
#           4)通过对li列表的切片形成新的列表l4, l4 = [3, "a", "b"]
l4 = li[1:6:2]
print(l4)
#           5)通过对li列表的切片形成新的列表l5, l5 = ["c"]
l5 = li[-1]
print(l5)
#           6)通过对li列表的切片形成新的列表l6, l6 = ["b", "a", 3]
l6 = li[-3::-2]
print(l6)